Revit 2024 API
Noise Class
 A static class that provides access to the property names that appear in the Noise visual asset schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static class Noise
Visual Basic
Public NotInheritable Class Noise
Visual C++
public ref class Noise abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Noise
See Also
Noise Members
Autodesk.Revit.DB.Visual Namespace